{
  "backend/main.mo": "Defines the backend canister with access control, user profiles, categories, products, promo codes, customers, and orders using core Map collections and comparison modules.",
  "feature_evidence.json": "Lists feature evidence entries mapping features to frontend files, components, and test IDs for authentication-aware account UI and profile flows.",
  "frontend-file-summaries.txt": "Provides short descriptions of many frontend files covering routing, UI components, hooks, pages, and state management.",
  "frontend/index.css": "Defines Tailwind base layers and extensive CSS variables for light/dark theming and component colors.",
  "frontend/index.html": "Basic HTML entry point loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Sets up the full application router with storefront and admin routes, mixing eager and lazy-loaded pages wrapped in layout and theme providers.",
  "frontend/src/components/admin/AdminShell.tsx": "Admin layout providing header, sidebar navigation, and logout handling wrapped in an admin access guard.",
  "frontend/src/components/auth/AdminRouteGuard.tsx": "Guards admin pages by checking authentication and admin status, redirecting or showing an access-denied screen.",
  "frontend/src/components/LoadingSpinner.tsx": "Simple loading spinner component with centered animated indicator.",
  "frontend/src/components/seo/Seo.tsx": "SEO helper that updates the document title and meta description on mount.",
  "frontend/src/components/site/StorefrontFooter.tsx": "Renders the storefront footer with branding, navigation links, contact info, and a dynamic year plus referral link.",
  "frontend/src/components/site/StorefrontHeader.tsx": "Implements the storefront header with navigation, cart count, authentication handling, and responsive mobile menu.",
  "frontend/src/components/site/StorefrontLayout.tsx": "Wraps pages with a shared header and footer layout structure.",
  "frontend/src/components/storefront/PromoCodeBox.tsx": "Provides UI and logic for validating, applying, and removing promo codes during checkout.",
  "frontend/src/hooks/mutations/usePlaceOrder.ts": "Mutation hook that creates or fetches a customer and submits an order, invalidating related queries on success.",
  "frontend/src/hooks/queries/useAuth.ts": "Authentication-related hooks for checking admin status, fetching and saving the caller's user profile.",
  "frontend/src/hooks/queries/useCategories.ts": "Category CRUD hooks using react-query with cache invalidation and toast notifications.",
  "frontend/src/hooks/queries/useOrders.ts": "Order retrieval and update hooks, including status changes, unseen counts, and customer lookup.",
  "frontend/src/hooks/queries/useProducts.ts": "Product CRUD and retrieval hooks, including filtering by category and updating react-query caches.",
  "frontend/src/hooks/queries/usePromoCodes.ts": "React Query hooks for CRUD operations and validation of promo codes using the backend actor.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on Internet Identity, invalidating dependent queries on identity change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling login, logout, stored identities, and status tracking.",
  "frontend/src/index.css": "Tailwind CSS setup with custom light and dark theme variables and utility classes.",
  "frontend/src/main.tsx": "App entry point setting up React Query and Internet Identity providers before rendering the app.",
  "frontend/src/pages/admin/AdminCategoriesPage.tsx": "Admin page for listing, creating, editing, and deleting product categories with dialogs and forms.",
  "frontend/src/pages/admin/AdminCustomersPage.tsx": "Admin page that derives customers from orders and displays their info and order histories using accordions.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Displays admin dashboard stats for orders, revenue, products, and categories using fetched data, with quick navigation actions.",
  "frontend/src/pages/admin/AdminLoginPage.tsx": "Handles admin login via Internet Identity, checks admin privileges, and redirects or shows login/logout options.",
  "frontend/src/pages/admin/AdminOrdersPage.tsx": "Shows a filterable orders table with status updates, marking as seen, and CSV export.",
  "frontend/src/pages/admin/AdminProductsPage.tsx": "Provides product listing with dialogs for creating, editing, and deleting products.",
  "frontend/src/pages/admin/AdminPromoCodesPage.tsx": "Manages promo codes with creation, editing, deletion, and a form for discount settings.",
  "frontend/src/pages/storefront/AccountPage.tsx": "Displays and edits user profile data, with login handling via Internet Identity.",
  "frontend/src/pages/storefront/CartPage.tsx": "Renders the shopping cart with item quantity controls, promo code support, and price calculations, with an empty-cart fallback. Allows updating and removing items before checkout.",
  "frontend/src/pages/storefront/CheckoutPage.tsx": "Handles order checkout with user details, validation, promo codes, and order submission. Redirects to confirmation page after placing the order.",
  "frontend/src/pages/storefront/ContactPage.tsx": "Displays contact information, business hours, and an about section for Fal Sarovar. Provides phone, email, and location details.",
  "frontend/src/pages/storefront/HomePage.tsx": "Landing page showcasing hero content, best sellers, and health-focused messaging. Fetches products and highlights top items.",
  "frontend/src/pages/storefront/MenuPage.tsx": "Shows product catalog with category filters, product details modal, and add‑to‑cart functionality. Loads categories and products from API.",
  "frontend/src/pages/storefront/OrderConfirmationPage.tsx": "Displays order confirmation details using the order ID and provides navigation options back to home or the menu.",
  "frontend/src/state/cartStore.ts": "Defines a persisted Zustand store for cart items with add, remove, update, clear, and total calculation logic.",
  "frontend/src/state/useCart.ts": "Provides a convenience hook that exposes cart store state and actions.",
  "frontend/src/utils/exportOrders.ts": "Generates a CSV file from order and product data and triggers a client-side download.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, retrieving, and clearing URL and session parameters.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, typography, animations, container settings, and plugin integrations.",
  "project_state.json": "Stores the project’s current build state, high-level requirements, architecture notes, and implemented features."
}