{
  "backend/main.mo": "Main canister defining storage, access control, data types, comparisons, and CRUD logic for users, categories, products, variants, promo codes, customers, and orders.",
  "backend/migration.mo": "Migration utility that transforms old categories, products, and orders into the new schema with image blobs, variant support, and updated product/order fields.",
  "feature_evidence.json": "Feature evidence report listing implemented features, related files, components, and test IDs with high‑confidence metadata.",
  "frontend-file-summaries.txt": "Prewritten summaries of major frontend files including hooks, pages, components, and state modules.",
  "frontend/index.css": "Tailwind base/theme variable definitions for light and dark modes with color tokens and global styles.",
  "frontend/index.html": "Base HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "React router configuration with storefront and admin routes using lazy loading and shared layout components.",
  "frontend/src/components/admin/AdminShell.tsx": "Admin layout with header, sidebar navigation, and logout handling wrapped in an admin route guard.",
  "frontend/src/components/admin/ProductImagesEditor.tsx": "UI for adding, previewing, and removing product images via file upload or URL input.",
  "frontend/src/components/admin/ProductVariantsEditor.tsx": "Editor for creating, updating, and deleting product variants tied to a product ID.",
  "frontend/src/components/auth/AdminRouteGuard.tsx": "Protects admin routes by checking authentication and admin status, redirecting or showing an access-denied screen.",
  "frontend/src/components/LoadingSpinner.tsx": "Simple spinner component showing a centered animated loading indicator.",
  "frontend/src/components/seo/Seo.tsx": "Sets page title and meta description dynamically using React effects.",
  "frontend/src/components/site/StorefrontFooter.tsx": "Storefront footer with branding, quick links, contact info, and attribution.",
  "frontend/src/components/site/StorefrontHeader.tsx": "Responsive storefront header with navigation, cart indicator, auth handling, and mobile menu.",
  "frontend/src/components/site/StorefrontLayout.tsx": "Page layout wrapper that combines the storefront header, footer, and main content.",
  "frontend/src/components/storefront/OrderHistory.tsx": "Displays a customer’s order history with order totals, statuses, dates, and item details including variants.",
  "frontend/src/components/storefront/ProductVariantPicker.tsx": "Renders selectable product variants, filtering only active and in-stock options for size selection.",
  "frontend/src/components/storefront/PromoCodeBox.tsx": "Provides promo code input, validation, and feedback, applying or clearing discounts for an order.",
  "frontend/src/hooks/mutations/usePlaceOrder.ts": "Mutation hook that creates or fetches a customer and submits a new order, then refreshes related queries.",
  "frontend/src/hooks/queries/useAuth.ts": "Authentication-related hooks for admin checks, retrieving and saving the caller’s user profile.",
  "frontend/src/hooks/queries/useCategories.ts": "Category CRUD hooks that fetch, create, update, and delete categories while invalidating cache appropriately.",
  "frontend/src/hooks/queries/useOrders.ts": "Order-related hooks for fetching orders, updating status, marking as seen, and retrieving customer info.",
  "frontend/src/hooks/queries/useProducts.ts": "Product CRUD and lookup hooks for fetching all products, by category, by id, and creating/updating/deleting products.",
  "frontend/src/hooks/queries/usePromoCodes.ts": "React-query hooks for fetching, validating, creating, updating, and deleting promo codes via the actor API with toast notifications.",
  "frontend/src/hooks/queries/useVariants.ts": "React-query hooks to manage product variants including fetching by product, CRUD operations, and cache invalidation.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on Internet Identity, invalidating dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context with login, logout, identity loading, and status management using AuthClient.",
  "frontend/src/index.css": "Tailwind CSS setup defining theme variables, dark mode styles, and custom utility classes.",
  "frontend/src/main.tsx": "App entry point initializing React, QueryClientProvider, InternetIdentityProvider, and global styles.",
  "frontend/src/pages/admin/AdminCategoriesPage.tsx": "Admin UI for listing, creating, editing, and deleting categories with dialogs, file uploads, and react-query mutations.",
  "frontend/src/pages/admin/AdminCustomersPage.tsx": "Fetches all orders, groups them by customer, and displays customer info with order history in an accordion.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Loads order, product, and category stats to render an admin dashboard with metrics and quick actions.",
  "frontend/src/pages/admin/AdminLoginPage.tsx": "Handles admin authentication via Internet Identity and redirects authorized users to the dashboard.",
  "frontend/src/pages/admin/AdminOrdersPage.tsx": "Displays all orders with filtering, status updates, marking as seen, and CSV export functionality.",
  "frontend/src/pages/admin/AdminProductsPage.tsx": "Manages creation, editing, and deletion of products with dialogs, category selection, and image/variant editing.",
  "frontend/src/pages/admin/AdminPromoCodesPage.tsx": "Manages promo codes including creation, editing, deletion, and activation settings through dialogs.",
  "frontend/src/pages/storefront/AccountPage.tsx": "Displays the user's account page with profile editing, sign‑in flow, and order history retrieval using various hooks.",
  "frontend/src/pages/storefront/CartPage.tsx": "Shows cart contents, handles quantity updates, promo code discounts, and displays empty‑cart or checkout navigation states.",
  "frontend/src/pages/storefront/CheckoutPage.tsx": "Implements checkout with form validation, promo handling, order submission, and redirects to confirmation after placing an order.",
  "frontend/src/pages/storefront/ContactPage.tsx": "Static contact information page with phone, email, location, hours, and a brief description of the brand.",
  "frontend/src/pages/storefront/HomePage.tsx": "Home page displaying hero content and a product grid with quick‑add logic and product previews.",
  "frontend/src/pages/storefront/MenuPage.tsx": "Menu page that loads categories, products, and variants, displays them with filters, and allows adding selected variants to the cart via a modal dialog.",
  "frontend/src/pages/storefront/OrderConfirmationPage.tsx": "Displays order confirmation details using the order ID from the URL and provides navigation back to home or the menu.",
  "frontend/src/state/cartStore.ts": "Zustand store managing cart items with add, remove, update, clear, and total calculation functions, persisted in local storage.",
  "frontend/src/state/useCart.ts": "Convenience hook that exposes the cart Zustand store.",
  "frontend/src/utils/blob.ts": "Utility helpers for converting files and URLs to ExternalBlob objects and generating preview URLs or handling file uploads.",
  "frontend/src/utils/exportOrders.ts": "Converts orders to a CSV file using product metadata and triggers a client-side download.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, storing, and clearing URL parameters with sessionStorage support and hash‑based routing handling.",
  "frontend/tailwind.config.js": "Tailwind CSS config extending colors, fonts, animations, and container settings, with plugin support for typography, container queries, and animations.",
  "project_state.json": "Describes the current project state for extending the Fal Sarovar app, outlining goals like richer catalog features, Firebase-based architecture, and a list of existing implemented features. Includes summary, architectural notes, and configuration metadata for versioned project tracking."
}